jelli123/LPC1115_Emulator/src/fault.cpp
#include "fault.h"
#include "opcodes.h"
#include "peripherals.h"
#include "gdb_stub.h"
#include "iap.h"
#include "emulator.h"
#include "config.h"
#include "vnvic.h"

#include <cstdio>
#include <cstdint>
#include <cstring>
#include "hardware/watchdog.h"
#include "pico/stdlib.h"
#include "RP2350.h"

namespace faultsys {

namespace {
Stats g_stats{};
}

Stats stats() { return g_stats; }

void init() { g_stats = {}; }

} // namespace faultsys

namespace {

// Bildet eine Gast-Adresse (LPC-Sicht 0x0000.. / 0x1000.. ODER bereits auf
// das RP2350-SRAM relozierte Adresse) auf einen lesbaren Host-Pointer ab und
// liest 4 Bytes. Liefert false, wenn die Adresse in keinem gemappten Bereich
// liegt (dann kein Zugriff -> handler-safe, auch fuer Muelladressen).
bool guest_read32_safe(uint32_t addr, uint32_t& out) {
    const uint32_t lb = emulator::load_base();
    const uint32_t rb = emulator::guest_ram_base();
    uint32_t host;
    if (addr < emulator::LPC_LOAD_MAX_SIZE) {
        host = lb + addr;                                   // LPC-Flash [0,64K)
    } else if (addr >= 0x1000'0000u &&
               addr <  0x1000'0000u + emulator::LPC_GUEST_RAM_SIZE) {
        host = rb + (addr - 0x1000'0000u);                  // LPC-SRAM
    } else if (addr >= lb && addr < lb + emulator::LPC_LOAD_MAX_SIZE) {
        host = addr;                                        // reloziertes Flash
    } else if (addr >= rb && addr < rb + emulator::LPC_GUEST_RAM_SIZE) {
        host = addr;                                        // reloziertes SRAM
    } else {
        return false;
    }
    std::memcpy(&out, reinterpret_cast<const void*>(host), 4);
    return true;
}

// Nicht-emulierbarer Gast-Fault: Gast ANHALTEN statt das ganze Silizium per
// Watchdog zu rebooten. Frueher loeste jeder fatale Fault watchdog_enable(50)
// + Spin aus -> voller RP2350-Reboot, der die soeben ausgegebene [FAULT]-
// Diagnose UND die USB-CDC-Sitzung vernichtete ("RP2350 resettet"). Jetzt:
// State=Faulted setzen (LED flackert, 'stats' zeigt Faulted), Core0/CLI laeuft
// weiter, die Diagnose bleibt lesbar. Recovery ueber CLI ('reset'/'run') oder
// erneutes Flashen. Laeuft auf Core1 und kehrt nie zurueck (Core1 parkt).
[[noreturn]] void enter_fatal_halt() {
    emulator::notify_guest_faulted();
    std::printf("[FAULT] Gast angehalten (State=Faulted) — 'reset' oder neue "
                "Firmware zum Fortfahren.\n");
    for (;;) __asm volatile ("wfe");
}

} // namespace

// --- Trap-Handler (in C, von Asm-Wrapper aus aufgerufen) ------------------
//
// frame zeigt auf den exception-stacked Frame des Gastes
// (r0,r1,r2,r3,r12,lr,pc,xpsr). r4_r11_lr zeigt auf den vom Asm-Wrapper
// gepushten Block {r4,r5,r6,r7,r8,r9,r10,r11,lr_excret}. SP des Gastes
// während der gefehlerten Instruktion = (uint32_t)frame + 0x20 (8 Dwords).
//
// Zugriffe auf den unprivilegierten Gast-Stack durch privilegierten Code
// sind erlaubt (PRIVDEFENA=1, MPU schränkt nur unprivileged ein).

extern "C" void handle_memfault_c(trap_decoder::StackedFrame* frame,
                                  uint32_t* r4_r11_lr) {
    using namespace trap_decoder;

    // IAP-ROM-Trap: Guest hat über Funktionspointer 0x1FFF1FF1 in den
    // BootROM gesprungen. Adresse existiert auf RP2350 nicht → Prefetch-
    // Fault. Wir bedienen den IAP-Aufruf und springen über LR zurück.
    if ((frame->pc & ~1u) == iap::ROM_ENTRY_TARGET) {
        auto* params  = reinterpret_cast<uint32_t*>(frame->r0);
        auto* results = reinterpret_cast<uint32_t*>(frame->r1);
        iap::dispatch(params, results);
        frame->pc = frame->lr & ~1u;
        SCB->CFSR = SCB->CFSR;
        ++faultsys::g_stats.mem_traps;
        return;
    }

    // IACCVIOL: Guest versuchte Code an einer nicht-relocierten LPC-Adresse
    // auszufuehren (Flash-Funktionspointer in Literal-Pool / .data).
    // Wir leiten den PC auf die tatsaechliche Position im RP2350-SRAM um.
    uint32_t cfsr = SCB->CFSR;
    if (cfsr & 0x01u) {  // MMFSR.IACCVIOL
        uint32_t fpc = frame->pc;
        // LPC-Flash [0, 64 KB) -> load_base + offset. Der gesamte LPC-Flash ist
        // ausfuehrbar und liegt vollstaendig (0xFF-gepaddet) im g_firmware_image;
        // IAP-/OTA-Schreibvorgaenge landen ebenfalls dort. Daher jede Flash-
        // Adresse bedienen, nicht nur die urspruenglich geladene Code-Laenge —
        // sonst faultet Code einer ueber den Bus nachgeladenen (ggf. groesseren)
        // Applikation jenseits von firmware_size() in einen Watchdog-Reset.
        if (fpc < emulator::LPC_LOAD_MAX_SIZE) {
            frame->pc = emulator::load_base() + fpc;
            SCB->CFSR = cfsr;
            ++faultsys::g_stats.mem_traps;
            return;
        }
        // LPC SRAM [0x10000000, 0x10000000 + RAM_SIZE) → guest_ram + offset
        if (fpc >= 0x1000'0000u &&
            fpc <  0x1000'0000u + emulator::LPC_GUEST_RAM_SIZE) {
            frame->pc = emulator::guest_ram_base() + (fpc - 0x1000'0000u);
            SCB->CFSR = cfsr;
            ++faultsys::g_stats.mem_traps;
            return;
        }
    }

    uint32_t* r4_r11 = r4_r11_lr;       // 8 Werte
    uint32_t  guest_sp = reinterpret_cast<uint32_t>(frame) + 0x20;

    Access acc{};
    if (!decode_mem_access(frame, r4_r11, guest_sp, acc)) {
        ++faultsys::g_stats.real_faults;
        faultsys::g_stats.last_fault_pc   = frame->pc;
        faultsys::g_stats.last_fault_addr = SCB->BFAR;
        std::printf("[FAULT] non-decodable @PC=0x%08lx CFSR=0x%08lx BFAR=0x%08lx\n",
                    static_cast<unsigned long>(frame->pc),
                    static_cast<unsigned long>(SCB->CFSR),
                    static_cast<unsigned long>(SCB->BFAR));

        // --- Erweiterte Diagnose ------------------------------------------
        // Register-Frame des Gastes (Cortex-M Standard-Stacking) + Gast-SP.
        const uint32_t lb = emulator::load_base();
        auto lpc = [&](uint32_t a) -> long {            // Host->LPC-Offset, sonst -1
            return (a >= lb && a < lb + emulator::LPC_LOAD_MAX_SIZE)
                       ? static_cast<long>(a - lb) : -1L;
        };
        std::printf("[FAULT]  r0=%08lx r1=%08lx r2=%08lx r3=%08lx r12=%08lx\n",
                    (unsigned long)frame->r0, (unsigned long)frame->r1,
                    (unsigned long)frame->r2, (unsigned long)frame->r3,
                    (unsigned long)frame->r12);
        std::printf("[FAULT]  LR=%08lx (LPC 0x%lx)  xPSR=%08lx  SP=%08lx\n",
                    (unsigned long)frame->lr, lpc(frame->lr & ~1u),
                    (unsigned long)frame->xpsr, (unsigned long)guest_sp);
        std::printf("[FAULT]  r4=%08lx r5=%08lx r6=%08lx r7=%08lx\n",
                    (unsigned long)r4_r11[0], (unsigned long)r4_r11[1],
                    (unsigned long)r4_r11[2], (unsigned long)r4_r11[3]);

