jelli123/LPC1115_Emulator/src/fault.cpp
        // Bei IACCVIOL (Code-Fetch an nicht gemappter Adresse): wilder Sprung,
        // typ. ueber korrupten C++-Vtable-/Funktionspointer. LR = Aufrufer,
        // r0 = this-Pointer bei virtuellen Aufrufen. Vtable-Kette aufdroeseln.
        if (SCB->CFSR & 0x01u) {
            uint32_t vt = 0, m0 = 0, m2 = 0, m11 = 0;
            std::printf("[FAULT]  Code-Fetch (IACCVIOL): wilder Sprung nach 0x%08lx\n",
                        (unsigned long)frame->pc);
            if (guest_read32_safe(frame->r0, vt)) {
                std::printf("[FAULT]  this=r0=0x%08lx -> vtable=0x%08lx\n",
                            (unsigned long)frame->r0, (unsigned long)vt);
                bool b0  = guest_read32_safe(vt + 0,  m0);
                bool b2  = guest_read32_safe(vt + 8,  m2);
                bool b11 = guest_read32_safe(vt + 44, m11);
                std::printf("[FAULT]  vtable[0]=%s vtable[2]=%s vtable[11]=%s\n",
                            b0  ? "" : "?", b2 ? "" : "?", b11 ? "" : "?");
                std::printf("[FAULT]   = 0x%08lx / 0x%08lx / 0x%08lx\n",
                            (unsigned long)m0, (unsigned long)m2,
                            (unsigned long)m11);
            } else {
                std::printf("[FAULT]  this=r0=0x%08lx (nicht gemappt)\n",
                            (unsigned long)frame->r0);
            }
        }
        SCB->CFSR = SCB->CFSR;          // Sticky-Bits clearen
        // Gast anhalten (kein Silizium-Reboot mehr) — Diagnose bleibt sichtbar.
        enter_fatal_halt();
    }

    // Emulieren
    bool ok = true;

    // SCB-Kontroll-Block (0xE000ED00-0xE000ED1F): liegt in einer Read-Only-MPU-
    // Region, damit Gast-SCHREIBzugriffe hier trappen (Reads passieren dank RO
    // nativ). Wichtigster Fall: AIRCR.SYSRESETREQ via NVIC_SystemReset() (z. B.
    // sblib BcuBase::softSystemReset). Auf dem M33 wuerde das nativ das ECHTE
    // RP2350-Silizium rebooten (USB/CLI weg) — wir fangen es ab und starten nur
    // den Gast neu. ICSR/SCR/CCR/SHPR werden auf den realen SCB durchgereicht
    // (der Gast laeuft ja nativ auf dem M33); VTOR wird ignoriert (Host
    // verwaltet die Vektorbasis ueber den Handover).
    if (acc.address >= 0xE000'ED00u && acc.address <= 0xE000'ED1Fu) {
        const uint32_t reg = acc.address & ~3u;
        if (acc.is_load) {
            uint32_t v = *reinterpret_cast<volatile uint32_t*>(reg);
            uint32_t* dst = reg_ptr(frame, r4_r11, &guest_sp, acc.rt);
            if (dst) *dst = v;
            frame->pc += acc.instr_size;
            SCB->CFSR = SCB->CFSR;
            ++faultsys::g_stats.mem_traps;
            return;
        }
        uint32_t src_val = 0;
        if (acc.rt < 16) {
            uint32_t* p = reg_ptr(frame, r4_r11, &guest_sp, acc.rt);
            if (p) src_val = *p;
        }
        if (reg == 0xE000'ED0Cu) {                    // AIRCR
            // VECTKEY (0x05FA) korrekt UND SYSRESETREQ (Bit 2) -> nur Gast-Reset.
            if (((src_val >> 16) == 0x05FAu) && (src_val & (1u << 2))) {
                ++faultsys::g_stats.mem_traps;
                emulator::request_guest_reset();     // Core1 parkt bis Core0-Reset
                return;                              // (falls je Core0: regulaer)
            }
            // sonstige AIRCR-Schreibzugriffe (VECTCLRACTIVE etc.) ignorieren
        } else if (reg != 0xE000'ED08u) {            // != VTOR -> auf realen SCB
            volatile uint32_t* p = reinterpret_cast<volatile uint32_t*>(reg);
            if (acc.size == AccessSize::W) {
                *p = src_val;
            } else {                                  // partieller Zugriff: RMW
                uint32_t shift = (acc.address & 3u) * 8u;
                uint32_t mask  = (acc.size == AccessSize::B) ? 0xFFu : 0xFFFFu;
                *p = (*p & ~(mask << shift)) | ((src_val & mask) << shift);
            }
        }   // VTOR (0xE000ED08): ignorieren
        frame->pc += acc.instr_size;
        SCB->CFSR = SCB->CFSR;
        ++faultsys::g_stats.mem_traps;
        return;
    }

    // LPC-Flash-Bereich (gesamte 64 KB): Daten aus dem geladenen Firmware-
    // Image liefern. Der Guest liest z. B. .data-Initialisierungswerte ueber
    // einen nicht-relocierten Flash-Pointer (Scatter-Load-Tabelle) ODER greift
    // direkt auf hohe Flash-Sektoren zu, die nicht zum Code gehoeren — etwa
    // ein flash-basiertes EEPROM. sblib (BCU2/MASK0701) legt sein userEeprom
    // z. B. im letzten Sektor (0xF000-0xFFFF) ab und liest es per memcpy direkt
    // aus dem Flash. Das g_firmware_image ist stets volle LPC_LOAD_MAX_SIZE
    // gross und mit 0xFF gepaddet (== geloeschtes Flash); IAP-Schreibvorgaenge
    // landen ebenfalls dort. Daher den gesamten Flashbereich bedienen, nicht
    // nur die geladene Code-Laenge — sonst faulten EEPROM-Reads jenseits des
    // Images und loesen einen Watchdog-Reset aus.
    if (acc.address < emulator::LPC_LOAD_MAX_SIZE) {
        if (acc.is_load) {
            auto* img = reinterpret_cast<const uint8_t*>(emulator::load_base());
            uint32_t value = 0;
            switch (acc.size) {
                case AccessSize::B: {
                    uint8_t v = img[acc.address];
                    value = acc.is_signed
                        ? static_cast<uint32_t>(static_cast<int32_t>(static_cast<int8_t>(v)))
                        : v;
                    break;
                }
                case AccessSize::H: {
                    uint16_t h;
                    std::memcpy(&h, img + acc.address, 2);
                    value = acc.is_signed
                        ? static_cast<uint32_t>(static_cast<int32_t>(static_cast<int16_t>(h)))
                        : h;
                    break;
                }
                case AccessSize::W: {
                    std::memcpy(&value, img + acc.address, 4);
                    break;
                }
            }
            uint32_t* dst = reg_ptr(frame, r4_r11, &guest_sp, acc.rt);
            if (dst) *dst = value;
        }
        // Writes to Flash: silently ignore (Flash is read-only).
        frame->pc += acc.instr_size;
        SCB->CFSR = SCB->CFSR;
        ++faultsys::g_stats.mem_traps;
        return;
    }

    // LPC-SRAM-Bereich [0x10000000, +RAM_SIZE): Wird ein RAM-Pointer von der
    // Lade-Heuristik (hex_patcher) nicht reloziert — typisch bei zur Laufzeit
    // *berechneten* Adressen (base + offset), die als reiner Basiswert nicht
    // exakt im Scan-Bereich liegen — dann wuerde der Zugriff sonst bei
    // peripherals::mmio_* abgelehnt und einen Watchdog-Reset ausloesen.
    // Statt zu faulten lenken wir den Zugriff hier deterministisch auf den
    // Gast-RAM um. So wird jeder von der Heuristik verpasste RAM-Pointer
    // *korrekt* bedient (nur etwas langsamer, da getrappt) statt fatal.
    {
        const uint32_t asz = (acc.size == AccessSize::B) ? 1u
                           : (acc.size == AccessSize::H) ? 2u : 4u;
        // Strikte Host-Bounds-Pruefung (inkl. Straddle am Bereichsende):
        // verhindert OOB-Zugriffe auf den g_guest_ram-Puffer.
        if (acc.address >= 0x1000'0000u &&
            acc.address + asz <= 0x1000'0000u + emulator::LPC_GUEST_RAM_SIZE) {
            uint32_t off = acc.address - 0x1000'0000u;
            auto* ram = reinterpret_cast<uint8_t*>(emulator::guest_ram_base());
            if (acc.is_load) {
                uint32_t value = 0;
                switch (acc.size) {
                    case AccessSize::B: {
                        uint8_t v = ram[off];
                        value = acc.is_signed
                            ? static_cast<uint32_t>(static_cast<int32_t>(static_cast<int8_t>(v)))
                            : v;
                        break;
                    }
                    case AccessSize::H: {
                        uint16_t h;
                        std::memcpy(&h, ram + off, 2);
                        value = acc.is_signed
                            ? static_cast<uint32_t>(static_cast<int32_t>(static_cast<int16_t>(h)))
                            : h;
                        break;
                    }
                    case AccessSize::W:
                        std::memcpy(&value, ram + off, 4);
                        break;
                }
                uint32_t* dst = reg_ptr(frame, r4_r11, &guest_sp, acc.rt);
                if (dst) *dst = value;
            } else {
                uint32_t src_val = 0;
                if (acc.rt < 16) {
                    uint32_t* p = reg_ptr(frame, r4_r11, &guest_sp, acc.rt);
                    if (p) src_val = *p;
                }
                switch (acc.size) {
                    case AccessSize::B:
                        ram[off] = static_cast<uint8_t>(src_val & 0xFFu);
                        break;
                    case AccessSize::H: {
                        uint16_t h = static_cast<uint16_t>(src_val & 0xFFFFu);
                        std::memcpy(ram + off, &h, 2);
                        break;
                    }
                    case AccessSize::W:
                        std::memcpy(ram + off, &src_val, 4);
                        break;
                }
            }
            frame->pc += acc.instr_size;
            SCB->CFSR = SCB->CFSR;
            ++faultsys::g_stats.mem_traps;
            return;
        }
    }

    if (acc.is_load) {
        uint32_t value = 0;
        switch (acc.size) {
            case AccessSize::B: {
                uint8_t v = 0;
                ok = peripherals::mmio_read8(acc.address, v);
                value = acc.is_signed
                    ? static_cast<uint32_t>(static_cast<int32_t>(static_cast<int8_t>(v)))
                    : v;
                break;
            }
            case AccessSize::H: {
                uint8_t lo = 0, hi = 0;
                ok = peripherals::mmio_read8(acc.address, lo) &&
                     peripherals::mmio_read8(acc.address + 1, hi);
                uint16_t h = static_cast<uint16_t>(lo | (hi << 8));
                value = acc.is_signed
                    ? static_cast<uint32_t>(static_cast<int32_t>(static_cast<int16_t>(h)))
                    : h;
                break;
            }
            case AccessSize::W: {
                uint8_t b[4]{};
                for (int i = 0; i < 4 && ok; ++i)
                    ok = peripherals::mmio_read8(acc.address + i, b[i]);
                value = static_cast<uint32_t>(b[0])       |
                        (static_cast<uint32_t>(b[1]) << 8) |
                        (static_cast<uint32_t>(b[2]) << 16) |
                        (static_cast<uint32_t>(b[3]) << 24);
                break;
            }
        }
        uint32_t* dst = reg_ptr(frame, r4_r11, &guest_sp, acc.rt);
        if (dst) *dst = value;
    } else {
        uint32_t  src_val = 0;
        if (acc.rt < 16) {
            uint32_t* p = reg_ptr(frame, r4_r11, &guest_sp, acc.rt);
            if (p) src_val = *p;
        }
        switch (acc.size) {
            case AccessSize::B:
                ok = peripherals::mmio_write8(acc.address,
                                              static_cast<uint8_t>(src_val & 0xFFu));
                break;
            case AccessSize::H:
                ok = peripherals::mmio_write8(acc.address,
                                              static_cast<uint8_t>(src_val & 0xFFu)) &&
                     peripherals::mmio_write8(acc.address + 1,
                                              static_cast<uint8_t>((src_val >> 8) & 0xFFu));
                break;
            case AccessSize::W:
                for (int i = 0; i < 4 && ok; ++i)
                    ok = peripherals::mmio_write8(acc.address + i,
                                                  static_cast<uint8_t>((src_val >> (i*8)) & 0xFFu));
                break;
        }
    }

    if (!ok) {
        ++faultsys::g_stats.real_faults;
        faultsys::g_stats.last_fault_pc   = frame->pc;
        faultsys::g_stats.last_fault_addr = acc.address;
        std::printf("[FAULT] mmio rejected @PC=0x%08lx addr=0x%08lx\n",
                    static_cast<unsigned long>(frame->pc),
                    static_cast<unsigned long>(acc.address));
        SCB->CFSR = SCB->CFSR;
        enter_fatal_halt();
    }

    ++faultsys::g_stats.mem_traps;
    // Post-Hook (z. B. PLL-Re-Konfiguration nach abgeschlossenem 32-bit-Wort).
    if (!acc.is_load) peripherals::on_post_write_hook();

