jelli123/LPC1115_Emulator/src/fault.cpp
    // Bootloader->App-Handover: SP-Korrektur anwenden, falls der soeben
    // emulierte SYSMEMREMAP-Store den Uebergang ausgeloest hat. Der Bootloader
    // fuehrt als naechste Instruktion `mov SP, StackTop` aus; wir ersetzen den
    // rohen LPC-RAM-StackTop im gestackten r4..r11-Block durch die relocierte
    // Gast-RAM-Adresse, damit der SP auf gueltiges RP2350-SRAM zeigt.
    {
        uint32_t sp_raw = 0, sp_reloc = 0;
        if (emulator::take_handover_sp_fixup(sp_raw, sp_reloc)) {
            for (int i = 0; i < 8; ++i) {
                if (r4_r11[i] == sp_raw) r4_r11[i] = sp_reloc;
            }
        }
    }

    // PC vorrücken
    frame->pc += acc.instr_size;
    // Sticky-Bits clearen (CFSR write-1-to-clear)
    SCB->CFSR = SCB->CFSR;
}

// --- Naked Exception-Handler ---------------------------------------------
// Der Pico-SDK-Linker erwartet die ISR-Symbole `isr_*`. Wir registrieren
// MemManage und BusFault. UsageFault (z. B. UDF, illegal opcode) und
// HardFault behandeln wir als echten Fault → Watchdog-Reset.

extern "C" __attribute__((naked)) void isr_busfault() {
    __asm volatile (
        "tst   lr, #4              \n"
        "ite   eq                  \n"
        "mrseq r0, msp             \n"
        "mrsne r0, psp             \n"
        "push  {r4-r11, lr}        \n"
        "sub   sp, #4              \n"   // 8-Byte-Alignment
        "add   r1, sp, #4          \n"   // r1 = &{r4..r11, lr_excret}
        "bl    handle_memfault_c   \n"
        "add   sp, #4              \n"
        "pop   {r4-r11, lr}        \n"
        "bx    lr                  \n"
    );
}

extern "C" __attribute__((naked)) void isr_memmanage() {
    __asm volatile (
        "tst   lr, #4              \n"
        "ite   eq                  \n"
        "mrseq r0, msp             \n"
        "mrsne r0, psp             \n"
        "push  {r4-r11, lr}        \n"
        "sub   sp, #4              \n"
        "add   r1, sp, #4          \n"
        "bl    handle_memfault_c   \n"
        "add   sp, #4              \n"
        "pop   {r4-r11, lr}        \n"
        "bx    lr                  \n"
    );
}

// HardFault. Sonderfall WFI-Pin-Wakeup (opt-in): Führt der Gast `WFI` mit
// gesperrten Interrupts aus (`PRIMASK=1`, das gängige
// "__disable_irq(); __WFI();"-Idiom), so kann der aus dem Patch entstandene
// `SVC #0` die SVCall-Exception nicht aktivieren (Priorität maskiert) und
// eskaliert zu HardFault (HFSR.FORCED=1). Wir erkennen das an der
// gefehlerten Instruktion (`0xDF00`) und behandeln es wie WFI: pollen echte
// Pin-Flanken/Timer, setzen bei fälligem IRQ PendSV (bleibt unter PRIMASK
// pending und feuert, sobald der Gast die Interrupts wieder freigibt) und
// kehren hinter das WFI zurück. PRIMASK des Gastes bleibt unangetastet.
extern "C" void hardfault_c(uint32_t* exc_frame) {
    if (config::wfi_pin_wakeup() && (SCB->HFSR & SCB_HFSR_FORCED_Msk)) {
        uint32_t pc = exc_frame[6];
        const uint16_t* ip = reinterpret_cast<const uint16_t*>(pc & ~1u);
        if (*ip == 0xDF00) {                 // SVC #0 (gepatchtes WFI)
            for (;;) {
                peripherals::sample_pin_interrupts();
                peripherals::poll_timed_sources();
                if (vnvic::irq_pending()) {
                    SCB->ICSR = SCB_ICSR_PENDSVSET_Msk;
                    break;
                }
                busy_wait_us(50);
            }
            exc_frame[6] = (pc & ~1u) + 2u;  // hinter das WFI/SVC zurück
            SCB->HFSR = SCB->HFSR;           // FORCED w1c
            ++faultsys::g_stats.mem_traps;
            return;
        }
    }
    enter_fatal_halt();
}

extern "C" __attribute__((naked)) void isr_hardfault() {
    __asm volatile (
        "tst   lr, #4              \n"
        "ite   eq                  \n"
        "mrseq r0, msp             \n"
        "mrsne r0, psp             \n"
        "push  {r4-r11, lr}        \n"
        "bl    hardfault_c         \n"
        "pop   {r4-r11, lr}        \n"
        "bx    lr                  \n"
    );
}

// Bei aktivem GDB-Stub fängt UsageFault BKPT-Instruktionen (Software-
// Breakpoints) und delegiert an den Stub. Andernfalls Watchdog-Reset.
extern "C" void usagefault_c(uint32_t* exc_frame, uint32_t* r4_r11) {
    if (SCB->CFSR & SCB_CFSR_UNDEFINSTR_Msk) {
        uint16_t instr = *reinterpret_cast<uint16_t*>(exc_frame[6]);
        if ((instr & 0xFF00) == 0xBE00) {            // BKPT
            if (gdb_stub::active()) {
                gdb_stub::on_breakpoint(exc_frame, r4_r11);
                SCB->CFSR = SCB->CFSR;
                return;
            }
        }
    }
    SCB->CFSR = SCB->CFSR;
    enter_fatal_halt();
}

extern "C" __attribute__((naked)) void isr_usagefault() {
    __asm volatile (
        "tst   lr, #4              \n"
        "ite   eq                  \n"
        "mrseq r0, msp             \n"
        "mrsne r0, psp             \n"
        "push  {r4-r11, lr}        \n"
        "sub   sp, #4              \n"
        "add   r1, sp, #4          \n"
        "bl    usagefault_c        \n"
        "add   sp, #4              \n"
        "pop   {r4-r11, lr}        \n"
        "bx    lr                  \n"
    );
}

// DebugMonitor: M33 löst diese Exception nach genau einer ausgeführten
// Instruktion aus, sobald DEMCR.MON_EN=1 und MON_STEP=1 sind und
// DHCSR.C_DEBUGEN=0 (kein DAP angehängt). Wir nutzen das für sauberes
// GDB-Single-Step.
extern "C" void debugmon_c(uint32_t* exc_frame, uint32_t* r4_r11) {
    // MON_STEP wieder löschen, sonst tritt die Exception erneut auf.
    CoreDebug->DEMCR &= ~CoreDebug_DEMCR_MON_STEP_Msk;
    if (gdb_stub::active()) {
        gdb_stub::on_breakpoint(exc_frame, r4_r11);
    }
}

extern "C" __attribute__((naked)) void isr_debugmon() {
    __asm volatile (
        "tst   lr, #4              \n"
        "ite   eq                  \n"
        "mrseq r0, msp             \n"
        "mrsne r0, psp             \n"
        "push  {r4-r11, lr}        \n"
        "sub   sp, #4              \n"
        "add   r1, sp, #4          \n"
        "bl    debugmon_c          \n"
        "add   sp, #4              \n"
        "pop   {r4-r11, lr}        \n"
        "bx    lr                  \n"
    );
}

void setup_fault_handlers() {
    faultsys::init();
}
